logging_app/app/controllers/logs_controller.rb

  def index
    result = Log.all
    result = result.where(name: params[:name]) unless params[:name].nil?
    result = result.where(result: params[:result]) unless params[:result].nil?
    result = result.where(operation_type: params[:type]) unless params[:type].nil?
    result = result.where('DATE(date) = ? ', params[:date]) unless params[:date].nil?
---
SELECT "logs".* FROM "logs"
SELECT "logs".* FROM "logs" WHERE "logs"."name" = ? AND "logs"."result" = ?  [["name", "Anton"], ["result", 0]]
SELECT "logs".* FROM "logs" WHERE (DATE(date) = '2023-10-22' )
SELECT "logs".* FROM "logs" WHERE "logs"."name" = ? AND "logs"."operation_type" = ?  [["name", "Anton"], ["operation_type", "exit"]]
SELECT "logs".* FROM "logs" WHERE (DATE(date) = '2023-10-23' )