logging_app/app/services/block_service.rb

  def update_ticket_status
    my_ticket = Ticket.find_by_id_ticket(@ticket_info[:id_ticket])
    if my_ticket.nil?
      Ticket.create(id_ticket: @ticket_info[:id_ticket], blocked: true)
    else
      my_ticket.update(blocked: true)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id_ticket" = ? LIMIT ?  [["id_ticket", 1], ["LIMIT", 1]]
INSERT INTO "tickets" ("id_ticket", "created_at", "updated_at", "blocked") VALUES (?, ?, ?, ?)  [["id_ticket", 1], ["created_at", "2023-10-22 11:14:15.921064"], ["updated_at", "2023-10-22 11:14:15.921064"], ["blocked", 1]]
UPDATE "tickets" SET "updated_at" = ?, "blocked" = ? WHERE "tickets"."id" = ?  [["updated_at", "2023-10-21 12:56:39.157334"], ["blocked", 1], ["id", 1]]