logging_app/app/services/create_log.rb

INSERT INTO "logs" ("id_ticket", "date", "name", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id_ticket", 1], ["date", "2023-10-21 14:49:51.446406"], ["name", "Anton"], ["result", 0], ["created_at", "2023-10-21 14:49:51.469947"], ["updated_at", "2023-10-21 14:49:51.469947"]]
---
  def create_log
    Log.create(id_ticket: @id_ticket,
               date: Time.now, name: @name,
               operation_type: @operation_type,
               result: @result)