logging_app/app/services/ticket_service.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id_ticket" = ? LIMIT ?  [["id_ticket", 2], ["LIMIT", 1]]
---
  def get_ticket_info
    @ticket_info = TicketSiteAdapter.new.get_ticket(params[:ticket_id])
    @my_ticket = Ticket.find_by_id_ticket(@ticket_info[:id_ticket])

INSERT INTO "tickets" ("id_ticket", "category", "doc_type", "doc_num", "date", "status", "created_at", "updated_at", "blocked", "name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "tickets" SET "status" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["status", "out"], ["updated_at", "2023-10-22 11:11:35.999638"], ["id", 1]]
---
  def update_ticket
    status = get_status
    if @my_ticket.nil?
      Ticket.create(id_ticket: @ticket_info[:id_ticket],
                    category: @ticket_info[:category],
                    doc_type: @ticket_info[:doc_type],
                    doc_num: @ticket_info[:doc_num],
                    date: @ticket_info[:date],
                    status: status,
                    name: @ticket_info[:name],
                    blocked: false)
    else
      @my_ticket.update(id_ticket: @ticket_info[:id_ticket],
                        category: @ticket_info[:category],
                        doc_type: @ticket_info[:doc_type],
                        doc_num: @ticket_info[:doc_num],
                        date: @ticket_info[:date],
                        status: status,
                        name: @ticket_info[:name],
                        blocked: false)